.emacs.d/init.el

(use-package hydra)

(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))

(rune/leader-keys
  "ts" '(hydra-text-scale/body :which-key "scale text"))

(defhydra hydra-buffer-menu (:color pink
                             :hint nil
                             :timeout 10)
  "
^Mark^             ^Unmark^           ^Actions^          ^Search
^^^^^^^^-----------------------------------------------------------------
_m_: mark          _u_: unmark        _x_: execute       _R_: re-isearch
_s_: save          _U_: unmark up     _b_: bury          _I_: isearch
_d_: delete        ^ ^                _g_: refresh       _O_: multi-occur
_D_: delete up     ^ ^                _T_: files only: % -28`Buffer-menu-files-only
_~_: modified
"
  ("m" Buffer-menu-mark)
  ("u" Buffer-menu-unmark)
  ("U" Buffer-menu-backup-unmark)
  ("d" Buffer-menu-delete)
  ("D" Buffer-menu-delete-backwards)
  ("s" Buffer-menu-save)
  ("~" Buffer-menu-not-modified)
  ("x" Buffer-menu-execute)
  ("b" Buffer-menu-bury)
  ("g" revert-buffer)
  ("T" Buffer-menu-toggle-files-only)
  ("O" Buffer-menu-multi-occur :color blue)
  ("I" Buffer-menu-isearch-buffers :color blue)
  ("R" Buffer-menu-isearch-buffers-regexp :color blue)
  ("c" nil "cancel")
  ("v" Buffer-menu-select "select" :color blue)
  ("o" Buffer-menu-other-window "other-window" :color blue)
  ("q" quit-window "quit" :color blue))

(define-key Buffer-menu-mode-map "." 'hydra-buffer-menu/body)

(defhydra hydra-bookmark-menu (:color pink
                               :hint nil
                               :timeout 10)
  "
       ^Mark^                ^Actions^              ^Search^            ^Annotations
      ^^^^^^^^-----------------------------------------------------------------------
      _m_: mark         _x_: execute          _/_: isearch             _a_: show
      _u_: unmark       _r_: rename           _w_: locate              _A_: show all
      _U_: unmark up    _R_: relocate bmk     _S_: show filenames      _e_: edit
      _d_: delete       _s_: save bmk list    _T_: hide filenames
      _D_: delete up    _l_: load bmk list    _t_: toggle filenames
      "
  ("m" bookmark-bmenu-mark)
  ("u" bookmark-bmenu-unmark)
  ("U" bookmark-bmenu-backup-unmark)
  ("d" bookmark-bmenu-delete)
  ("D" bookmark-bmenu-delete-backwards)
  ("x" bookmark-bmenu-execute-deletions)
  ("r" bookmark-bmenu-rename)
  ("R" bookmark-bmenu-relocate)  
  ("s" bookmark-bmenu-save)
  ("l" bookmark-bmenu-load)  
  ("/" bookmark-bmenu-search)
  ("w" bookmark-bmenu-locate)
  ("S" bookmark-bmenu-show-filenames)  
  ("T" bookmark-bmenu-hide-filenames)
  ("t" bookmark-bmenu-toggle-filenames)
  ("a" bookmark-bmenu-show-annotation)
  ("A" bookmark-bmenu-show-all-annotations)
  ("e" bookmark-bmenu-edit-annotation)
  ("c" nil "cancel")
  ("v" bookmark-bmenu-select "select" :color blue)
  ("o" bookmark-bmenu-other-window "other-window" :color blue)
  ("C-o" bookmark-bmenu-switch-window "switch-other-window" :color blue)
  ("1" bookmark-bmenu-1-window "full-frame" :color blue)
  ("2" bookmark-bmenu-2-window "show-on-split-window" :color blue)
  ("5" bookmark-bmenu-other-frame "other-frame" :color blue)
  ("q" quit-window "quit" :color blue))

;;  (define-key bookmark-bmenu-mode-map "." 'hydra-bookmark-menu/body)

(rune/leader-keys
  "b"  '(:ignore lm :which-key "bookmarks")
  "bl" '(bookmark-bmenu-list :which-key "bookmark list")
  "bm" '(hydra-bookmark-menu/body :which-key "bookmark list menu"))

(defhydra hydra-global-org-menu (:color blue
                                   :timeout 4)
  " Org Utilities

    ^Timer^                ^Clock^              ^Capture
    ^^^^^^-------------------------------------------------------------------------
     _t_: Start         _w_: Clock-In          _c_: Capture
     _s_: Stop          _o_: Clock-Out         _l_: Last Capture
     _r_: Set           _j_: Clock-Goto        ^ ^
     _p_: Print
     "

  ("t" org-timer-start "Start Timer")
  ("s" org-timer-stop "Stop Timer")
  ;; This one requires you be in an orgmode doc, as it sets the timer for the header
  ("r" org-timer-set-timer "Set Timer")
  ;; output timer value to buffer
  ("p" org-timer "Print Timer")
  ;; used with (org-clock-persistence-insinuate) (setq org-clock-persist t)
  ("w" (org-clock-in '(4)) "Clock-In")
  ;; you might also want (setq org-log-note-clock-out t)
  ("o" org-clock-out "Clock-Out")
  ;; global visit the clocked task
  ("j" org-clock-goto "Clock Goto")
  ;; Don't forget to define the captures you want http://orgmode.org/manual/Capture.html
  ("c" org-capture "Capture")
  ("l" org-capture-goto-last-stored "Last Capture"))

(rune/leader-keys
    "o"  '(:ignore u :which-key "org")
    "ou" '(hydra-global-org-menu/body :which-key "org global utilities"))

(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
